#include "What_to_eat.h"

void Etc::ShowInfo() 
{
	int i = rand() % food->size(); //0부터 (M-1)까지의 수가 생성됨
	cout << food[i] << "가 땡긴다" << endl << endl;
	cout << "*****추천식당*****" << endl;

	switch (i) {
	case 0:		//쌀국수
		cout << "포맨티코 " << "0507-1314-2682" << endl;
		cout << "웰컴포 " << "051-512-5773" << endl;
		cout << "월면가 " << "051-991-1717" << endl;
		break;
	case 1:		//샤브샤브
		cout << "샤브앤나베 " << "0507-1328-4550" << endl;
		cout << "샤브향 " << "051-515-3006" << endl;
		cout << "채선당 " << "051-582-4460" << endl;
		break;
	case 2:		//카레
		cout << "인디키친 " << "070-7340-0555" << endl;
		cout << "뭄마이 " << "051-991-1417" << endl;
		cout << "카레야" << "070-4197-7771" << endl;
		break;
	case 3:		//밀면,칼국수
		cout << "전통쑥밀면 " << "051-515-9337" << endl;
		cout << "유림부대밀면 " << "051-512-6692" << endl;
		cout << "황금칼국수" << "051-515-3005" << endl;
		break;
	case 4:		//샐러드
		cout << "나우잇 " << "0507-1346-9713" << endl;
		cout << "도르샐러드 " << "0507-1411-6328" << endl;
		cout << "레오앤아그너스" << "070-7728-3201" << endl;
		break;
	case 5:		//샌드위치
		cout << "4242샌드위치 " << "0507-1318-4243" << endl;
		cout << "테토테 " << "051-517-9073" << endl;
		cout << "옐로우그램 " << "010-6493-1990" << endl;
		break;
	case 6:		//토스트
		cout << "이삭토스트 " << "070-8771-0033" << endl;
		cout << "테그42 " << "0507-1340-8922" << endl;
		cout << "에그드랍 " << "070-4793-7778" << endl;
		break;
	case 7:		//맥주
		cout << "벤스하버 " << "051-518-3771" << endl;
		cout << "일층집 " << "0507-1302-4578" << endl;
		cout << "테라스원 " << "051-517-5151" << endl;
		break;
	}
}