#include <iostream>
#include <cstdlib>
#include <string>
#include <ctime>

using namespace std;

class Western
{
private:
	string food[8] = { "스테이크","파스타","피자","리조또","햄버거","필라프","브런치","부리또" };
	string restaurant[8][3] = {
		{"설어정", "잇쇼우안 스테이크", "시어링앤 스터프"},		//스테이크
		{"리틀프랑","레오","마린파스타"},						//파스타
		{"에쎄노베","17테이블","꼬모도화덕피자"},				//피자
		{"델라고","리멘시타","미태리"},						//리조또
		{"791버거트럭","버거킹","맥도날드"},					//햄버거
		{"다락마을","코코브라운","스푼"},						//필라프
		{"웬디스키친","더브런치","브런치가든숲"},				//브런치
		{"엘부리또","나우잇","테토테"}						//부리또
	};
	string Phone[8][3] = {
		{"051-583-1239","0507-1365-0019","0507-1320-6227"},
		{"051-581-0056","0507-1416-7799","051-913-2399"},
		{"070-7755-4088","0507-1394-1718","0507-1414-9995"},
		{"051-515-1504","051-513-1001","051-635-5525"},
		{"0507-1419-7910","070-7462-6769","070-7017-0406"},
		{"051-513-8003","0507-1403-0777","051-611-9486"},
		{"0507-1409-5043","051-518-9074","0507-1324-3382"},
		{"051-518-3306","0507-1346-9713","051-517-9073"},
	};
	string Address[8][3] = {
		{"부산 금정구 장전로12번길 19","부산 금정구 부산대학로50번길 40","부산 금정구 부산대학로49번길 52"},
		{"부산 금정구 부산대학로 50","부산 금정구 장전로20번길 22 1층","부산 금정구 부산대학로63번길 47"},
		{"부산 금정구 장전온천천로83번길 14","부산 금정구 금정로60번길 20","부산 금정구 금강로 254-1"},
		{"부산 금정구 금강로 253-1","부산 금정구 금강로 254","부산 금정구 부산대학로63번길 29"},
		{"부산 금정구 금정로 61-1 1층 791버거트럭","부산 금정구 금정로 66","부산 금정구 금정로60번길 24"},
		{"부산 금정구 금정로60번길 40","부산 금정구 금강로 250","부산 금정구 기찰로 69"},
		{"부산 금정구 부산대학로50번길 54 1층","부산 금정구 금강로279번길 4","부산 금정구 금정로 126 1층"},
		{"부산 금정구 금강로279번길 30-7 1층","부산 금정구 금강로 271-11 1층 102호","부산 금정구 금정로91번길 8"},
	};
public:
	void ShowInfo()
	{
		int i = rand() % 8;
		cout << food[i] << "은(는) 어때요?" << endl << endl;
		cout << "*****추천식당*****" << endl;

		for (int j = 0; j < 3; j++)
			cout << restaurant[i][j] << ' ' << Phone[i][j] << ' ' << Address[i][j] << endl;
	}
};

class Etc
{
private:
	string food[8] = { "쌀국수", "샤브샤브", "카레", "족발", "샐러드", "샌드위치", "토스트", "맥주" };
	string restaurant[8][3] = {
		{"포맨티코","웰컴포","월면가"},						//쌀국수
		{"샤브앤나베","샤브향","채선당"},						//샤브샤브
		{"인디키친","뭄마이","카레야"},						//카레
		{"더만족","마왕족발","수림로족발"},					//족발
		{"나우잇","도르샐러드","레오앤아그너스"},				//샐러드
		{"4242샌드위치","테토테","옐로우그램"},				//샌드위치
		{"이삭토스트","테그42","에그드랍"},					//토스트
		{"벤스하버","일층집","테라스원"},						//맥주
	};
	string Phone[8][3] = {
		{"0507-1314-2682","051-512-5773","051-991-1717"},
		{"0507-1328-4550","051-515-3006","051-582-4460"},
		{"070-7340-0555","051-991-1417","070-4197-7771"},
		{"0507-1396-6866","051-517-8966","051-518-7501"},
		{"0507-1346-9713","0507-1411-6328","070-7728-3201"},
		{"0507-1318-4243","051-517-9073","010-6493-1990"},
		{"070-8771-0033","0507-1340-8922","070-4793-7778"},
		{"051-518-3771","0507-1302-4578","051-517-5151"},
	};
	string Address[8][3] = {
		{"부산 금정구 장전로12번길 16","부산 금정구 금정로 59-1","부산 금정구 장전로 16-1 1층"},
		{"부산 금정구 수림로61번길 34-1","부산 금정구 장전온천천로 51","부산 금정구 중앙대로1685번길 7"},
		{"부산 금정구 장전로12번길 50","부산 금정구 금강로 271-6","부산 금정구 금강로 275"},
		{"부산 금정구 금강로279번길 3","부산 금정구 부산대학로50번길 19","부산 금정구 수림로75번길 1"},
		{"부산 금정구 금강로 271-11 1층","부산 금정구 부산대학로 30-3","부산 금정구 금강로 260-1 1층"},
		{"부산 금정구 금강로321번길 30 1층","부산 금정구 금정로91번길 8","부산 금정구 금강로335번길 21 1층"},
		{"부산 금정구 부산대학로 63","부산 금정구 금정로 59-1 1층","부산 금정구 금정로 76"},
		{"부산 금정구 장전로12번길 24","부산 금정구 장전온천천로 97","부산 금정구 장전온천천로 51"},
	};
public:
	void ShowInfo()
	{
		int i = rand() % 8;
		cout << food[i] << "은(는) 어때요?" << endl << endl;
		cout << "*****추천식당*****" << endl;

		for (int j = 0; j < 3; j++)
			cout << restaurant[i][j] << ' ' << Phone[i][j] << ' ' << Address[i][j] << endl;
	}
};

void Select(int sel)
{
	Western west;
	Etc etc;

	switch (sel) {
	case 1:
		break;
	case 2:
		break;
	case 3:
		break;
	case 4:
		west.ShowInfo();
		break;
	case 5:
		break;
	case 6:
		break;
	case 7:
		break;
	case 8:
		etc.ShowInfo();
		break;
	}
}

int main()
{
	int sel;
	string menu[8] = { "중식","일식","고기","양식","한식","치킨","분식/야식","기타" };
	srand((unsigned int)time(NULL)); //시드값 설정해주기.
	
	cout << "오늘 뭐 먹지..." << endl;
	cout << "1.중식 2.일식 3.고기 4.양식 5.한식 6.치킨 7.디저트 8.기타" << endl;
	cin >> sel;
	cout << menu[sel - 1] << "이(가) 땡긴다!" << endl;

	Select(sel);
	return 0;
}